** 基本算术运算
   :LOGBOOK:
   CLOCK: [2021-08-10 Tue 20:48]--[2021-08-10 Tue 23:00] =>  2:12
   CLOCK: [2021-08-10 Tue 15:59]--[2021-08-10 Tue 16:18] =>  0:19
   :END:

   可以做基本运算，还有一些其他的运算比如乘法。2的7次方是这样写，两个乘号。
   #+begin_src python :session op :exports both
2**7
   #+end_src

   #+RESULTS:
   : 128
   3/2是是严格的除法，
   #+begin_src python :session op :exports both
     3/2
   #+end_src

   #+RESULTS:
   : 1.5
   如果要整除的话写 3//2。
   #+begin_src python :session op :exports both
     3//2
   #+end_src

   #+RESULTS:
   : 1
   3%2 是取它的余数。
   
   #+begin_src python :session op :exports both
     3%2
   #+end_src

   #+RESULTS:
   : 1
   也可以使用高级功能，比如阶乘，阶乘需要使用使用 math 的库，要 =import math= 。3的阶乘是6，66的阶乘多大？
   #+begin_src python :session op :exports both
     import math
     math.factorial(66)
   #+end_src

   #+RESULTS:
   : 544344939077443064003729240247842752644293064388798874532860126869671081148416000000000000000

   这是 Python 的重要特点，整数是高精度的。在计算机的硬件里，每个数都要内存空间存储，我们如果学习C语言，需要知道有些整数用16比特，有些占用32比特，有些占用8比特，有的占用64比特。整数的范围是因定的。Python 又进行了一层抽象，使用软件实现了高精度的整数，在计算机可承受的范围内无上界。试试2的10000次方，
   #+begin_src python :session op :exports both
2**10000
   #+end_src

   #+RESULTS:
   : 19950631168807583848837421626835850838234968318861924548520089498529438830221946631919961684036194597899331129423209124271556491349413781117593785932096323957855730046793794526765246551266059895520550086918193311542508608460618104685509074866089624888090489894838009253941633257850621568309473902556912388065225096643874441046759871626985453222868538161694315775629640762836880760732228535091641476183956381458969463899410840960536267821064621427333394036525565649530603142680234969400335934316651459297773279665775606172582031407994198179607378245683762280037302885487251900834464581454650557929601414833921615734588139257095379769119277800826957735674444123062018757836325502728323789270710373802866393031428133241401624195671690574061419654342324638801248856147305207431992259611796250130992860241708340807605932320161268492288496255841312844061536738951487114256315111089745514203313820202931640957596464756010405845841566072044962867016515061920631004186422275908670900574606417856951911456055068251250406007519842261898059237118054444788072906395242548339221982707404473162376760846613033778706039803413197133493654622700563169937455508241780972810983291314403571877524768509857276937926433221599399876886660808368837838027643282775172273657572744784112294389733810861607423253291974813120197604178281965697475898164531258434135959862784130128185406283476649088690521047580882615823961985770122407044330583075869039319604603404973156583208672105913300903752823415539745394397715257455290510212310947321610753474825740775273986348298498340756937955646638621874569499279016572103701364433135817214311791398222983845847334440270964182851005072927748364550578634501100852987812389473928699540834346158807043959118985815145779177143619698728131459483783202081474982171858011389071228250905826817436220577475921417653715687725614904582904992461028630081535583308130101987675856234343538955409175623400844887526162643568648833519463720377293240094456246923254350400678027273837755376406726898636241037491410966718557050759098100246789880178271925953381282421954028302759408448955014676668389697996886241636313376393903373455801407636741877711055384225739499110186468219696581651485130494222369947714763069155468217682876200362777257723781365331611196811280792669481887201298643660768551639860534602297871557517947385246369446923087894265948217008051120322365496288169035739121368338393591756418733850510970271613915439590991598154654417336311656936031122249937969999226781732358023111862644575299135758175008199839236284615249881088960232244362173771618086357015468484058622329792853875623486556440536962622018963571028812361567512543338303270029097668650568557157505516727518899194129711337690149916181315171544007728650573189557450920330185304847113818315407324053319038462084036421763703911550639789000742853672196280903477974533320468368795868580237952218629120080742819551317948157624448298518461509704888027274721574688131594750409732115080498190455803416826949787141316063210686391511681774304792596709376

   这是 Python 的一大特色，它样做需要经过许多诸如内存判断，用多少内存，数量还会变化，多重判断会降低效率。但是现在计算机硬件水平，用效率损失来换取方便的接口是值得的。这也是本课程的基本价值观：如果能够节省人类的时间，不惜浪费计算机的时间。这与计算机专业研究有区别：计算机研究的目标，是让它更快，算法更巧妙，效率更高。

   整除有一些基本的约定，看几个例子
   #+begin_src python :session ob :export both
     -5 // -3
   #+end_src

   #+RESULTS:
   : 1

   #+begin_src python :session ob :export both
     -5 // 3
   #+end_src

   #+RESULTS:
   : -2
   往下面降。要注意，有些语言不是这样的约定，而是按照绝对值最小的方向去去降，那么-5整除3会给出-1。
   #+begin_src python :session ob :export both
     (-5 // 3) * 3 + (-5 % 3) == -5
   #+end_src

   #+RESULTS:
   : True
   
   除号和取余号也可以用在浮点数上。

** 布尔运算
   :LOGBOOK:
   CLOCK: [2021-08-11 Wed 20:34]--[2021-08-11 Wed 21:28] =>  0:54
   :END:
   布尔运算得到“真”“True”或者“假”“False”，是数理逻辑的范畴。否命题
   
   #+begin_src python :session ob :export both
     not True
   #+end_src

   #+RESULTS:
   : False

   #+begin_src python :session ob :export both
     not False
   #+end_src

   #+RESULTS:
   : True
   
   =and= 和 =or= 和数理逻辑的“和”跟“或”的定义是一样的。它的内部表示和其他语言很类似， =True= 和 =False= 不是全新的数据类型，它内部以数字形式存储。
   #+begin_src python :session ob :export both
     True + True
   #+end_src

   #+RESULTS:
   : 2
   严格的数理逻辑中，只是01运算，组成的加法群中， =True + True= 应该还是 =True= 。但是Python 中结果变成了 2。

   #+begin_src python :session ob :export both
     2 and True
   #+end_src

   #+RESULTS:
   : True

   此时 2 与 1 一样，都被当作 =True= 处理，即非零整数被在逻辑运算中是一个等价类。
   
   Python 的设计符合直觉和数理逻辑的定义。如果在布尔运算中用乘法也是自恰的，因为 =True= 是非零， =False= 是 0。这可以帮助我们理解 =True= 和 =False= 的实现。

   实际应用中 =True= 和 =False= 源于条件判断，如等号。“=”已经被赋值占用了，条件判断用“==”
   #+begin_src python :session ob :export both
     1==1
   #+end_src

   #+RESULTS:
   : True
   #+begin_src python :session ob :export both
     1==2
   #+end_src

   #+RESULTS:
   : False
   
   “不等于”在python里边是“!=”。

** 数据类型
   Python 有三个基本数据类型：

   - 整型 :: 我们刚看到的精度无限的整数；
   - 浮点型 :: 精度是有限的，常见的是64位高精度；
   - 字符串 :: 单个字符也是字符串，这与 C 语言不同。字符串拥有无限长度，在软件上把它进行了便利的实现和抽象。

   #+begin_src python :session ob :export both
     type(1)
   #+end_src

   #+RESULTS:
   : <class 'int'>

   #+begin_src python :session ob :export both
     type(1.5)
   #+end_src

   #+RESULTS:
   : <class 'float'>

   #+begin_src python :session ob :export both
     "今天" + "下雨了"
   #+end_src

   #+RESULTS:
   : 今天下雨了

   字符串用单引号和双引号都可以，一个好处是字符串里要输入一个单引号，可用双引号来引用。
   #+begin_src python :session ob :export both
     "'"
   #+end_src

   #+RESULTS:
   : '
   #+begin_src python :session ob :export both
     '"'
   #+end_src   

   #+RESULTS:
   : "
   这是双引号。 Python 3 所有的国际语言的符号都可内嵌到语言里，字符串可以直接使用汉字。相对于更基础的语言如C/C++，可以给我们非常大的便利。大家已经约定良好的处理字符串的方法都已经被 Python 作为默认功能。要入门程序语言，我们要打印“Hello World！” 向前人致敬。
   #+begin_src python :session ob :results output :export both
     print("Hello, world!")
   #+end_src

   #+RESULTS:
   : Hello, world!
   Print 是 Python 的一个函数，里面可加一个字符串。

** 变量
   Python 的变量与数学的含义类似，用以指代一个任何对象，例如字符串，
   #+begin_src python :session ob :results output :export both
     message = "This is an new era. 新时代"
     print(message)
   #+end_src

   #+RESULTS:
   : This is an new era. 新时代

   那么随后就可以用变量代替字符串。Python 的一大的特点是变量没有类型。我们可以看到，

   #+begin_src python :session ob :results output :export both
     message = 3840752916
     print(message)
   #+end_src

   #+RESULTS:
   : 3840752916

   =message= 这个变量既可以是字符串，也可以是整数。 Python 是无类型语言，这是很强的假设。如果语言的变量没有类型，那么它在运行中每次调用 =message= 时，都要检查它到底是什么类型。可以想象这样做需要额外的步骤调取内部的函数和库，Python 损失了很多效率。但是，我们喜欢！因为人类的脑子里也不区分整型、浮点型和字符串。Python 用它上层的软件库，给人带来了很多的便利，符合直觉是 Python 语言的一大特点。在做科学计算时，这个问题没那么简单了。学习 Numpy 时我们将看到，无类型变量的效率太低，我们只能再放弃一点便利，为了性能规定变量类型。
   
   变量本身也可以赋值给另一个变量，
   #+begin_src python :session ob :results output :export both
     m = message
     print(m)
   #+end_src

   #+RESULTS:
   : 3840752916

   =input()= 与 =print()= 对应，可以用来输入变量。例如：
   #+begin_src python :session ob :export both
     # q = input("Enter anything: ") # 输入 47042
     q = "47042" # 结果
     type(q)
   #+end_src

   #+RESULTS:
   : <class 'str'>
   注意得到的变量类型是字符串，如果需要数字，需要转换成整型。

   #+begin_src python :session ob :export both
     type(int(q))
   #+end_src

   #+RESULTS:
   : <class 'int'>

